---
kind: type
id: T:Autodesk.Revit.DB.WallFoundation
source: html/29a6e040-a36e-2a0c-5339-c69aa7776301.htm
---
# Autodesk.Revit.DB.WallFoundation

An object that represents a wall foundation element.

## Syntax (C#)
```csharp
public class WallFoundation : HostObject
```